Информационная_база/src/InformationRegisters/НомераСправочниковИДокументовДляИзмененияНаКлиентскомУзлеМП/НомераСправочниковИДокументовДляИзмененияНаКлиентскомУзлеМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НомераСправочниковИДокументовДляИзмененияНаКлиентскомУзлеМП</name>
  <resources>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>КодУзла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Ссылка</name>
    <type>
      <types>DocumentRef.ЗаказМП</types>
      <types>DocumentRef.РасходДенегМП</types>
      <types>DocumentRef.ОтчетОРозничныхПродажахМП</types>
      <types>CatalogRef.СпецификацииМП</types>
      <types>CatalogRef.СтавкиНДСМП</types>
      <types>DocumentRef.ЧекККММП</types>
      <types>CatalogRef.СтруктурныеЕдиницыМП</types>
      <types>CatalogRef.СтатьиМП</types>
      <types>DocumentRef.РасходТовараМП</types>
      <types>CatalogRef.КонтрагентыМП</types>
      <types>CatalogRef.ТоварыМП</types>
      <types>DocumentRef.ЧекККМВозвратМП</types>
      <types>CatalogRef.КассыККММП</types>
      <types>DocumentRef.ПриходТовараМП</types>
      <types>DocumentRef.ВводОстатковМП</types>
      <types>DocumentRef.ПроизводствоМП</types>
      <types>DocumentRef.ПриходДенегМП</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Информационная_база/src/InformationRegisters/НомераСправочниковИДокументовДляИзмененияНаКлиентскомУзлеМП/ManagerModule.bsl
Процедура ЗаписатьИнформацию(Структура) Экспорт
	
	НаборЗаписей = РегистрыСведений.НомераСправочниковИДокументовДляИзмененияНаКлиентскомУзлеМП.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Ссылка.Установить(Структура.Ссылка);
	НаборЗаписей.Отбор.КодУзла.Установить(Структура.КодУзла);
	
	НоваяЗапсиь = НаборЗаписей.Добавить();
	Для Каждого Элемент Из Структура Цикл
		НоваяЗапсиь[Элемент.Ключ] = Элемент.Значение;
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Функция ПроверитьНаличиеДанных(КодУзла) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НомераСправочниковИДокументовДляИзмененияНаКлиентскомУзлеМП.Ссылка КАК Ссылка,
		|	НомераСправочниковИДокументовДляИзмененияНаКлиентскомУзлеМП.Номер КАК Номер
		|ИЗ
		|	РегистрСведений.НомераСправочниковИДокументовДляИзмененияНаКлиентскомУзлеМП КАК НомераСправочниковИДокументовДляИзмененияНаКлиентскомУзлеМП
		|ГДЕ
		|	НомераСправочниковИДокументовДляИзмененияНаКлиентскомУзлеМП.КодУзла = &КодУзла";
	
	Запрос.УстановитьПараметр("КодУзла", КодУзла);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивСЗаписями = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Структура = Новый Структура("Ссылка, Номер", ВыборкаДетальныеЗаписи.Ссылка, ВыборкаДетальныеЗаписи.Номер);
		МассивСЗаписями.Добавить(Структура);
	КонецЦикла;
	
	Возврат МассивСЗаписями

КонецФункции

Процедура УдалитьЗаписи(КодУзла) Экспорт
	
	НаборЗаписей = РегистрыСведений.НомераСправочниковИДокументовДляИзмененияНаКлиентскомУзлеМП.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.КодУзла.Установить(КодУзла);
	НаборЗаписей.Записать();

КонецПроцедуры

Процедура УдалитьЗапись(Ссылка) Экспорт
	
	НаборЗаписей = РегистрыСведений.НомераСправочниковИДокументовДляИзмененияНаКлиентскомУзлеМП.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(Ссылка);
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура УдалитьЗаписьДляЦентральногоУзла(КодУзла, Ссылка) Экспорт
	
	НаборЗаписей = РегистрыСведений.НомераСправочниковИДокументовДляИзмененияНаКлиентскомУзлеМП.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(Ссылка);
	НаборЗаписей.Отбор.КодУзла.Установить(КодУзла);
	НаборЗаписей.Записать();

КонецПроцедуры
